In [86]:
# Dependencies
import pandas as pd
file_one = "./Resources/2014.csv"
gender_df = pd.read_csv(file_one,usecols=['starttime','gender'],
                          dtype={'starttime':str,                                
                                 'gender':str})

In [87]:
#gender_df = gender_df.rename(columns={'Start Time':'starttime','Gender':'gender'})

In [88]:
gender_df = gender_df[gender_df.starttime != 'starttime']
gender_df = gender_df[gender_df.starttime != 'Start Time']

In [89]:
gender_df = gender_df.dropna()

In [90]:
gender_df.count()

starttime    8081216
gender       8081216
dtype: int64

In [91]:
gender_df.dtypes

starttime    object
gender       object
dtype: object

In [92]:
gender_df["starttime"] = gender_df["starttime"].astype(str)

In [93]:
gender_df["start_date"] = gender_df["starttime"].map(lambda x: x[0:10])

In [94]:
gender_df.head()

             starttime gender  start_date
0  2014-01-01 00:00:06      1  2014-01-01
1  2014-01-01 00:00:38      1  2014-01-01
2  2014-01-01 00:03:59      1  2014-01-01
3  2014-01-01 00:05:15      1  2014-01-01
4  2014-01-01 00:05:18      1  2014-01-01

In [95]:
gender_df = gender_df.groupby(['start_date','gender']).count()[['starttime']]

In [96]:
gender_df.reset_index(inplace = True) 
gender_df.dropna()

      start_date gender  starttime
0     10/1/2014       0       1200
1     10/1/2014       1      20948
2     10/1/2014       2       5794
3     10/10/2014      0       2344
4     10/10/2014      1      22284
...          ...    ...        ...
1144  9/9/2014 1      1      14397
1145  9/9/2014 1      2       4157
1146  9/9/2014 2      0        263
1147  9/9/2014 2      1       3136
1148  9/9/2014 2      2        902

[1149 rows x 3 columns]

In [97]:
gender_df = gender_df.rename(columns={'starttime':'gender count'})

In [98]:
gender_df['gender'] = gender_df['gender'].map({'0' : 'unknown','1': 'male', '2' : 'female'})

In [99]:
gender_df.head()

   start_date   gender  gender count
0  10/1/2014   unknown          1200
1  10/1/2014      male         20948
2  10/1/2014    female          5794
3  10/10/2014  unknown          2344
4  10/10/2014     male         22284

In [100]:
#Export the data to csv
output_data_file = "./Resources/gender_2014.csv"
gender_df.to_csv(output_data_file, index = False, header=True)